In [1]:
import numpy as np
import pandas as pd
from sklearn import linear_model

In [6]:
df=pd.read_csv("hiring.csv")
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [10]:
import math
df.experience=df.experience.fillna("zero")
med=math.floor(df['test_score(out of 10)'].median())
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(med)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [12]:
reg=linear_model.LinearRegression()

In [21]:
import word2number.w2n as w2n
w2n.word_to_num('zero')

0

In [36]:
df['experience']=df['experience'].apply(w2n.word_to_num)

ValueError: Type of input is not string! Please enter a valid number word (eg. 'two million twenty three thousand and forty nine')

In [45]:
df['experience']=df['experience'].astype('string')
df.dtypes
df['experience']=df['experience'].apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [47]:
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression()

In [48]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [49]:
reg.predict([[12,10,10]])

array([92002.18340611])